<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="style.css" title="Color">
    <title>Biograf&iacute;a de Alan Turing</title>
   
</head>
<body>
    <h1>Alan Mathison Turing:</h1>
    <p>
        <a href="https://www.elcorreo.com/xlsemanal/wp-content/uploads/sites/5/2023/04/alan-turing-inventor-informatica-espia-codigo-enigma-segunda-guerra-mundial.jpg"
        Alan Turing></a>
        Es considerado como uno de los padres de la ciencia de la 
        <a href="https://es.wikipedia.org/wiki/Ciencias_de_la_computaci%C3%B3n">ciencia de la computaci&oacute;n</a>y precursor de la 
        <a href="https://es.wikipedia.org/wiki/Inform%C3%A1tica">inform&aacute;tica</a> moderna.
         Proporcionó una formalización influyente de los conceptos de
         <a href="https://es.wikipedia.org/wiki/Algoritmo">algoritmo</a> y computación: la 
         <a href="https://es.wikipedia.org/wiki/M%C3%A1quina_de_Turing">m&aacute;quina de Turing</a>
        Formuló su propia versión que hoy es ampliamente aceptada como la 
        <a href="https://es.wikipedia.org/wiki/Tesis_de_Church-Turing">tesis de Church-Turing</a> (1936).
    </p>
    <IMG SRC="C:/Users/CXC Dell/Downloads/imagen1.jpg" ALIGN=MIDDLE width="12%">

    <ul>
        <li><a href="#Nacio">Nacimiento</a></li>
        <li><a href="#2GM">La Segunda Guerra Mundial</a></li>
        <li><a href="#Tesis">Tesis Church-Turing</a></li>
        <li><a href="#Compu">Primeras Computadoras</a></li>
        <li><a href="#Muerte">Muerte de Turing</a></li>
      </ul>

      <h2 id="Nacio">Nacimiento </h2>
        <hr>

        <p>Turing naci&oacute; en el distrito londinense de Maida Vale. Su padre, Julius Mathison Turing (1873-1944),
            era miembro del cuerpo de funcionarios brit&aacute;nicos en la India. Su madre, Ethel Sara Stoney, era hija de Edward Waller Stoney, 
            ingeniero jefe de Madras Railways. Los Stoney eran una familia de la nobleza protestante angloirlandesa de los condados de 
            Tipperary y Longford, mientras que la propia Ethel hab&iacute;a pasado gran parte de su infancia en el condado de Clare.</p>

            <h3>Estudios</h3>
            <p>
                Entre enero de 1922 y 1926, Turing estudi&oacute; en la preparatoria Hazelhurst, 
                una escuela independiente en el pueblo de Frant en Sussex (hoy East Oriental).
                En 1926, con trece años, ingres&oacute; en el internado de Sherborne, en Dorset.
                Su primer d&iacute;a de clase coincidi&oacute; con la huelga general en Inglaterra,
                pero su determinaci&oacute;n por asistir a clase era tan firme que recorri&oacute; con su bicicleta
                los m&aacute;s de 96 km que separaban Southampton de su escuela, pasando la noche en una posada.
                La inclinaci&oacute;n natural de Turing hacia la matem&aacute;tica y la ciencia no le atrajo el respeto de sus profesores de Sherborne, 
                cuyo concepto de educaci&oacute;n hac&iacute;a mayor &eacute;nfasis en los cl&aacute;sicos. En la escuela de Sherbone, 
                gan&oacute; la mayor parte de los premios matem&aacute;ticos que se otorgaban y, adem&aacute;s, realizaba experimentos qu&iacute;micos por su cuenta,
                 aunque la opini&oacute;n del profesorado respecto a la independencia y ambici&oacute;n de Turing no era demasiado favorable. 
                 A pesar de ello, el joven continu&oacute; mostrando una singular habilidad para los estudios que realmente le gustaban, 
                 y lleg&oacute; a resolver problemas muy avanzados para su edad (16 años) sin ni siquiera haber estudiado c&aacute;lculo elemental.
            </p>

            <h2 id="2GM">La Segunda Guerra Mundial:
            </h2>
        <hr>

    <p>Durante la <a href="https://es.wikipedia.org/wiki/Segunda_Guerra_Mundial">Segunda Guerra Mundial</a>, Turing desempeñ&oacute; un papel crucial en el esfuerzo de guerra de los 
        Aliados al trabajar en el equipo que descifraba c&oacute;digos alemanes, en particular, 
        contribuy&oacute; al descifrado de la m&aacute;quina 
        <a href="https://es.wikipedia.org/wiki/Enigma_(m%C3%A1quina)">Enigma</a> utilizada por la Marina alemana. 
        Sus contribuciones en este campo fueron fundamentales para la victoria de los Aliados. 
        Después de la guerra, Turing se dedic&oacute; a la investigaci&oacute;n en inteligencia artificial y diseñ&oacute; la 
        <a href="https://es.wikipedia.org/wiki/M%C3%A1quina_de_Turing">"Maquina Turing"</a>
        un modelo te&oacute;rico que se considera la base de la computación moderna. 
        Su trabajo sent&oacute; las bases para el desarrollo de computadoras y programación.</p>

        <h2 id="Tesis">Tesis Church-Turing </h2>
        <hr>
        <p>La tesis de Church-Turing formula hipot&eacute;ticamente la equivalencia entre los conceptos de funci&oacute;n computable y m&aacute;quina de Turing, 
            que expresado en lenguaje corriente vendr&iacute;a a ser: <strong>«Todo algoritmo es equivalente a una m&aacute;quina de Turing».</strong> 
            No es en s&iacute; un teorema matem&aacute;tico: es una afirmaci&oacute;n formalmente indemostrable, 
            una hip&oacute;tesis que, no obstante, tiene una aceptación pr&aacute;cticamente universal.
        </p>
        <p> La tesis Church-Turing postula que cualquier modelo computacional existente tiene las mismas capacidades algor&iacute;tmicas,
            o un subconjunto, de las que tiene una m&aacute;quina de Turing.</p>

             <h3>M&aacute;quina de Turing</h3>
             <p>
                En su estudio Los n&uacute;meros computables, con una aplicación al Entscheidungsproblem (publicado el 28 de mayo de 1936), 
                Turing reformul&oacute; los resultados obtenidos por Kurt Gödel en 1931 sobre los l&iacute;mites de la demostrabilidad y la computaci&oacute;n,
                 sustituyendo al lenguaje formal universal descrito por Gödel por lo que hoy se conoce como máquina de Turing,
                  unos dispositivos formales y simples.
                
             </p>
             <p> Turing demostr&oacute; que dicha m&aacute;quina era capaz de resolver cualquier problema matem&aacute;tico que pudiera representarse mediante un
                algoritmo. Las m&aacute;quinas de Turing siguen siendo el objeto central de estudio en la teor&iacute;a de la computaci&oacute;n. 
                Lleg&oacute; a probar que no hab&iacute;a ninguna soluci&oacute;n para el problema de decisi&oacute;n, Entscheidungsproblem,
                 demostrando primero que el problema de la parada para las m&aacute;quinas de Turing es irresoluble: 
                 no es posible decidir algor&iacute;tmicamente si una m&aacute;quina de Turing dada llegar&aacute; a pararse o no. 
                 Aunque su demostraci&oacute;n se public&oacute; despu&eacute;s de la demostraci&oacute;n equivalente de Alonzo Church respecto a su c&aacute;lculo lambda,
                  el estudio de Turing es mucho más accesible e intuitivo.21​ Tambi&eacute;n fue pionero con su concepto de «m&aacute;quina universal 
                  (de Turing)», con la tesis de que dicha m&aacute;quina podría realizar las mismas tareas que cualquier otro tipo de m&aacute;quina. 
                  Su estudio tambi&eacute;n introduce el concepto de <span style="color: red;">n&uacute;meros definibles</span>. </p>

             <h2 id="Compu">Estudios sobre las primeras computadoras </h2>
             <hr>
             <p>
                De 1945 a 1948 Turing vivi&oacute; en Richmond, Londres, 
                donde trabajó en el Laboratorio Nacional de F&iacute;sica (NPL). En 1947 empez&oacute; a trabajar en el diseño del
                <span style="color: red;">ACE</span> (Automatic Computer Engine o Motor de Computaci&oacute;n Autom&aacute;tica). Paralelamente, 
                exist&iacute;a un proyecto similar en Estados Unidos llamado <a href="https://es.wikipedia.org/wiki/EDVAC">EDVAC</a> de 
                <a href="https://es.wikipedia.org/wiki/John_von_Neumann">Von Neumann</a> El ACE de Turing se diferenciaba en que inclu&iacute;a la 
                implementaci&oacute;n de funciones aritm&eacute;ticas en circuitos electr&oacute;nicos. Su deseo era crear una m&aacute;quina que pudiera ser configurada 
                para hacer c&aacute;lculos algebraicos, desencriptar c&oacute;digos, manipular archivos y jugar al ajedrez. 
                Aunque diseñar el ACE era factible, el secretismo que reinaba durante la guerra desemboc&oacute; en retrasos para iniciar el proyecto
                 por lo que Turing se sinti&oacute; desilusionado.
                 
                 <p>Tiempo m&aacute;s tarde cre&oacute; el <span style="color: red;"> Abbreviated Code Instruction</span> , que dio origen a los lenguajes 
                    de programaci&oacute;n. En 1947 se tom&oacute; un año sab&aacute;tico en Cambridge, tiempo durante el cual escribi&oacute; un trabajo pionero sobre la
                     inteligencia artificial que no fue publicado en vida. En 1948, con la ayuda de Frederic Calland Williams, se dio, 
                     por primera vez, la demostraci&oacute;n del principio de la m&aacute;quina de Turing.</p>
                  
                 <p> Mientras se encontraba en Cambridge y a pesar de su ausencia, se sigui&oacute; construyendo el prototipo piloto del ACE, 
                    que ejecut&oacute; su primer programa en mayo de 1950. Aunque la versi&Oacute;n completa del ACE de Turing jam&aacute;s fue construida, 
                    el diseño de otras computadoras en todo el mundo le debi&oacute; mucho a su concepci&oacute;n.</p>
                 
                <p> A mediados de 1948 fue nombrado director delegado del laboratorio de inform&aacute;tica de la Universidad de M&aacute;nchester 
                    y trabaj&oacute; en el software de una de las primeras computadoras reales, la Manchester Mark I. 
                    Durante esta etapa tambi&eacute;n realiz&oacute; estudios m&aacute;s abstractos y en su art&iacute;culo de octubre de 1950 
                    <a href="https://es.wikipedia.org/wiki/Computing_machinery_and_intelligence">"Computing Machinery ans Intelligence"</a>
                    Turing trat&oacute; el problema de la inteligencia artificial y propuso un experimento que hoy se conoce como
                    <a href="https://es.wikipedia.org/wiki/Prueba_de_Turing">prueba de Turing</a>  con la intenci&oacute;n de definir una prueba
                     est&aacute;ndar por la que una m&aacute;quina podr&iacute;a catalogarse como «sensible» o «sintiente». 
                     En el documento, Turing sugiri&oacute; que en lugar de construir un programa para simular la mente adulta, 
                     ser&iacute;a mejor producir uno más simple para simular la mente de un niño y luego someterlo a educaci&oacute;n. 
                     Una forma invertida de la prueba de Turing se usa ampliamente en Internet: 
                     el test <strong>CAPTCHA</strong> , que est&aacute; diseñado para 
                     determinar si un usuario es un humano y no un ordenador.</p>



             </p>
             <h2 id="Muerte">Muerte de Alan Turing </h2>
        <hr>

        <p>
            La carrera profesional de Turing se vio truncada cuando lo procesaron por su homosexualidad. En 1952, Arnold Murray, 
            un amante de Turing, ayud&oacute; a un c&oacute;mplice a entrar en la casa de Turing para robarle. 
            Turing acudi&oacute; a la polic&iacute;a a denunciar el delito. Durante la investigación policial Turing reconoci&oacute; su homosexualidad, 
            con lo que se le imputaron los cargos de «indecencia grave y perversi&oacute;n sexual»
             (los actos de homosexualidad eran ilegales en el Reino Unido en esa &eacute;poca), los mismos que a Oscar Wilde m&aacute;s de 50 años antes.
        </p>

        <p>
            Convencido de que no ten&iacute;a de qu&eacute; disculparse, no se defendi&oacute; de los cargos y fue condenado. 
            Seg&uacute;n su ampliamente difundido proceso judicial, se le dio la opci&oacute;n de ir a prisi&oacute;n o de someterse a
            <a href="https://es.wikipedia.org/wiki/Castraci%C3%B3n_qu%C3%ADmica">castraci&oacute;n qu&iacute;mica</a>
            mediante un tratamiento hormonal de reducci&oacute;n de la libido. Finalmente escogi&oacute; las inyecciones de 
            <a href="https://es.wikipedia.org/wiki/Estr%C3%B3geno">estr&oacute;genos</a>
            que duraron un año y le produjeron importantes alteraciones f&iacute;sicas,
             como la aparici&oacute;n de pechos o un apreciable aumento de peso, que lo condujeron a padecer de disfunción eréctil.
        </p>
<p>
    Dos años despu&eacute;s del juicio, en 1954, falleci&oacute; por envenenamiento con cianuro, aparentemente tras 
    comerse una manzana envenenada que no lleg&oacute; a ingerir completamente, en un contexto que se estim&oacute; oficialmente como suicidio.
</p>

<p>El 10 de septiembre de 2009, el primer ministro del Reino Unido, Gordon Brown, emiti&oacute; un comunicado 
    declarando sus disculpas en nombre de su gobierno por el trato que recibi&oacute; Alan Turing durante sus &uacute;ltimos años de vida. 
    Este comunicado fue consecuencia
     de una movilización p&uacute;blica solicitando al Gobierno que ofreciera disculpas oficialmente por la persecuci&oacute;n contra Alan Turing.</p>

<hr>
     <address>
        Escrito por Luis &Aacute;ngel Garc&iacute;a Marroqu&iacute;n</a>.<br>
        Visitanos en:<br>
        www.itorizaba.edu.com<br>
        CP 94340, Col. Zapata<br>
        Orizaba, Veracruz, México.
      </address>
</body>
</html>
